(function(){
    "use strict";
    var elBtnCalculate = document.getElementById("btnCalculate"),
        elBtnClear = document.getElementById("btnClear"),
        elErrorMsg = document.getElementById("errorMsg"),
        elTitle = document.getElementById("title"),
        elDetail = document.getElementById("detail"),
        elSwForm = document.getElementById("swForm");

    
    
    function show() {
        var dob = document.getElementById("inDOB").value;
        if( dob !== "") {
            var day = dob.slice(8, 10);
            var lucky=0;
            console.log(day);
            for ( var i=0; i<day.length;i++)   lucky+=parseInt(day[i],10);
            if(lucky==10) lucky=1;
            if(lucky==11) lucky=2;
           
            console.log(lucky);
                   
            var num1="<p>မင္းဟာ..ပါးနပ္တယ္..စကားကိုရွင္းရွင္းေျပာတက္တယ္..ဟာသဥာဏ္ရႊင္တယ္..ေခါင္းမာတယ္. ရိုးသား တယ္.. တဖက္သားကို မနာလို ၀န္တိုတတ္တယ္..ႀကင္နာတတ္တယ္..ေဒါသလြယ္တယ္..ေဖာ္ေရႊတယ္..တာ၀န္ယူလိုစိတ္ရွိတယ္..အျမဲတမ္းေက်ာ္ႀကားသူ တေယာက္ျဖစ္ခ်င္တယ္.. လူေတြ အားလံုး ရဲ့ အထက္မွာပဲ ေနခ်င္တယ္.. တစ္ခါ တစ္ရံ မွာ လြတ္လပ္မႈကို ျမတ္နိုးတယ္.. သူတပါးရဲ့ အုပ္ခ်ဳပ္မႈကို မခံခ်င္ ဘူး. မိမိကိုယ္ ကို ယံုႀကည္တတ္ တဲ့ လူစားမ်ိဳးျဖစ္တယ္.. ငယ္ငယ္ရႊယ္ရႊယ္ နဲ့ အခ်စ္ကို ေတြ႔တက္ႀကတယ္..ဒါေပမယ့္.. ရင့္က်က္တဲ့ အရြယ္ေရာက္မွ ပဲ လက္ထပ္ ၿဖစ္ႀကတာ မ်ားပါတယ္.. အျမင္မတူတဲ့ သူေတြနဲ့ ျပႆ           နာတက္ရတာ ကို နွစ္သက္တယ္.. အျငိဳးအေတးႀကီးျပီး..လက္စားေခ် တတ္ ႀကတယ္..အသံုးအျဖဳန္းႀကီးသူ တေယာက္ျဖစ္ေပမယ့္.. မင္းမွာ အလုပ္အကိုင္ေကာင္းေတြ ရတက္ပါတယ္.. မင္းသာ အမ်ိဳးသား ဆိုရင္..အရမ္းနာမည္ေက်ာ္မယ္.. ဆြဲေဆာင္မႈရွိတဲ့ ခႏၶာကိုယ္ကုိ ပိုင္ဆိုင္ေန မွာျဖစ္ျပီး ..လူတိုင္း က မင္းကို ေလးစားေနပါလိမ့္မယ္..မင္းဟာ.ေနရာစံု ၀င္ဆန့္နိုင္တဲ့သူ တေယာက္ျဖစ္တယ္.. ရပ္ကြက္ထဲမွ သည္.. ဟို အေပၚ ပါလီမန္ေတြ ထိကို မင္းက ေနရာစံုသြားနိုင္သူပါ. .ဘာျဖစ္လို့လဲ ဆိုေတာ့ ..ကိစၥေတာ္ေတာ္မ်ားမ်ား ကို မင္းက တဖတ္ကန္း ခတ္ေအာင္ သိေနတတ္တယ္ေလ.. ဒါေပမယ့္..မင့္ရဲ့ ဘ၀မွာ..တခ်ိဳ့လူေတြ က မင္းဘ၀ နွိပ့္က်သြားေအာင္..နာမည္ပ်က္ သြားေအာင္ လုပ္တာ မ်ိဳး..ႀကံုရတတ္ပါတယ္... ဒါကလည္း မဆန္းပါဘူး...လူေတြရဲ့ မနာလိုမႈေႀကာင့္ပါပဲ.. မင့္ရဲ့ မိသားစု ဘ၀က ေအးခ်မ္းလြန္းပါတယ္.. မင္းဟာ အေဖာ္မြန္ေကာင္း ကို ပိုင္ဆိုင္ျပီ.. ခ်စ္စဖြယ္ သား သမီးေတြ နဲ့ ေနထိုင္ ရပါလိမ့္မယ္..မင္းဟာ..ေရွ့ေဆာင္သူ..လြတ္လပ္မႈ ကို ျမတ္နိုးသူ.. ဘာသာတရား ကို ကိုယ္ရႈိုင္းသူ တေယာက္ပါပဲ.. မင္းရဲ့ အေကာင္းဆံုး အေဖာ္မြန္ နံပါတ္ေတြ ကေတာ့.. 4, 6, 8 ...သင့္တင္တဲ့ သူေတြကေတာ့.. 3, 5, 7!!! </p>";
            var num2 ="<p>မင္းဟာ ဘာႀကီးပဲျဖစ္ေနေန.. မင္းကို လူတိုင္းက ခ်စ္ႀကပါတယ္.. ဘာျဖစ္လို့လဲ ဆိုေတာ့..မင္းဟာလ နဲ့ တူလို့ပါ.. လကို လူတိုင္းက သေဘာက်သလိုမ်ိဳးေပါ့.. ျပီးေတာ့ မင္းဟာ..စိတ္ကူးအရမ္းယဥ္တက္သူ တစ္ဦးလည္းျဖစ္တယ္... မင္းဟာ ကို္ယ့္ကိုယ္ကို ယံုႀကည္မႈ အလြန္နည္းတယ္..မင္းဘ၀မွာ ျပန္ျပီးသုံးသပ္သင့္စရာေတြခ်ည္းပဲ... မင္းဟာ ခန့္မွန္းရခက္တဲ့ သူ တစ္ဦး လည္းျဖစ္တယ္.. အခ်ိန္နဲ့အေျခအေနကို လိုက္ျပီး မင္းဟာ အျမဲတမ္းေျပာင္းလဲေနတယ္.. တကိုယ္ေကာင္း ဆန္ျပီ.. အနုပညာဘက္ မွာ အား အေတာ္သန္တဲ့သူျဖစ္တယ္.. အေျပာအဆိုညက္ေညာေျပျပစ္တယ္.မင္းရဲ့ အျပဳအမႈေတြ ဟာ လ လို့ပဲ.. ေနအလင္းေရာင္ ေပ်ာက္မွ လ ထြက္လာ သလိုမ်ိဳး.... လူေတြ စိတ္ဓာ တ္ က်ေနတဲ့အခ်ိန္ဆို ေရာက္လာျပီ.. သူတို့ေတြ စိတ္ဓါတ္ျမင့္ တက္လာျပီ ဆိုရင္ မင္းဟာ သူတို့ ဘ၀ထဲ က ေပ်ာက္ကြယ္ သြားတက္တယ္..မင္းဟာ.. ျငိမ္းခ်မ္းမႈ ကို ျမတ္နိုးတဲ့.ဒုတိယ ဂႏၵီ ျဖစ္နိုင္သလို...ျငိမ္းခ်မ္းမႈ ကို ဖ်က္ဆီးမဲ့.. ဒုတိယ ဟစ္တလာ လည္း ျဖစ္နိုင္ပါတယ္ (က်ေနာ္ဆိုလို တာက မင္းရဲ့ ပတ္၀န္းက်င္ ဆက္ဆံေရးေပၚမွာပါ) တကယ့္လို႔ မ်ား. .ဘုရားတရား ကို နက္နက္ ရႈိုင္းရႈိုင္း လုပ္မယ္ဆိုရင္...မင္းဟာ ေအာင္ျမင္မယ့္ သူတစ္ဦးပါ...အမ်ားစုေသာ မင္းရဲ့ စကားလံုးေတြဟာ ေပ်ာ္ရႊင္မႈေတြဆီကို ပဲ ဦးတည္ေနတာပါ..!တခါတရံ မင္းဟာ ေရွ့ေရး ကို ႀကိဳျပီး ခံစားမိတတ္သူ တစ္ဦးပါ.မင္းဟာ ကဗ်ာဆရာ..စာေရးဆရာ.. အနုပညာနယ္ပယ္မွာ က်င္လည္မႈသူတစ္ဦးပါ...မင္းဟာ အခ်စ္ကို အရမ္းႀကီးမယံုႀကည္တက္သူတစ္ဦးပါ.. မင္းလက္ထက္ျပီးတဲ့အထိေတာင္ အဲဒီအတိုင္းပဲမင္းဟာ အခ်စ္အေပၚ သာမန္ပဲခံစားေနတက္သူတစ္ဦပါ..မင္းဟာ မိန္းကေလးဆိုရင္ေတာ့..မိသားစုမွာ တာ၀န္သိအမ်ိဳးသမီးတဦးျဖစ္ေနပါလိမ့္မယ္..မင္းဟာ ေယာက်ာ္းေလးသာဆိုရင္ေတာ့ မိသားစုမွာ ခိုက္ရန္ျဖစ္တာေတြ..ျငင္းခုန္မႈေတြကို သယ္ေဆာင္ လာသူ ျဖစ္ေန ပါလိမ့္မယ္..ဒါမွမဟုတ္ ေျပာင္းျပန္လည္း ျဖစ္ေနတက္ပါတယ္.. ဆိုလိုတာက.မိသားစုေကာင္း စားဖို့အတြက္ မင္းဘ၀ ကိုေတာင္ စြန့္လြတ္ဖို့ ၀န္မေလးတဲ့သူ တစ္ဦးပါ... မင္းဟာ သိမ့္ေမြ႔တယ္..အျမင္က်ယ္တယ္..သူတပါးရဲ့ စိတ္ ကို ခံစား နားလည္ေပးနိုင္တယ္.. လူေတြ နဲ့ လိုက္ေလ်ာ ညီေထြေနတက္တဲ့သူ တစ္ဦးပါ... မင္းရဲ့အေကာင္းဆံုး အေဖာ္မြန္ ကေတာ့ 2, 5, 9 ..တျခားသူေတြနဲ့ ဆိုရင္ေတာ့..အဆင္ေျပဖို့ ခဲရင္း ပါတယ္..!!!</p>";
            var num3="<p>နွလံုးသား မာေက်ာျပီ.. တကိုယ္ေကာင္းဆန္တတ္တယ္.. ဒါေပမယ့္ ဘာသာတရားကို ကိုင္းရႈိုင္းတက္သူ တစ္ဦးပါ.. တိုးတက္မႈကို ျမတ္နိုးတဲ့သူ တစ္ဦးပါ.. မင္းဟာ မိသားစုျပႆ       နာေတြ  ကို ေလွ်ာ့က်ဖို့  လိုလားေပမယ့္.. ျပႆ          နာတိုင္း   က မင္းဆီကေနပဲ ျမစ္ဖ်ား ခံတက္တာမ်ားပါတယ္.. မင္းဟာ ႀသဇာအာဏာႀကီးမားျပီး.. နွစ္လိုဖြယ္ မ်က္နွာထား ကို ပိုင္ဆိုင္သူ တစ္ဦးပါ.. ဒါေႀကာင့္.. ဘယ္ေနရာ ကို သြားသြား.. မင္း အလိုရွိတာေတြကို အဆင္သင့္ ရနိုင္ေနတာေပါ့.. မင္း ဘ၀မွာ ေမြးဖြားလာ ကတည္းက တခုခု ကို ရဖို့ အတြက္ အျမဲတမ္း ျပင္းထန္စြာ ႀကိဳးစား ေနရတတ္ တယ္.. မႀကိဳးစားဘဲနဲ့ ရလာတာ ဆိုတာ အလြန္ပဲ ရွားပါးလွပါတယ္.... အရြယ္ေရာက္လာတဲ့ အခါမွာ.. မင္းဟာ ကိုယ့္ထက္ ငယ္ရြယ္သူေတြ ကို ဆိုဆံုးမ တတ္တယ္.. ဘာေႀကာင့္ လဲ ဆိုေတာ့.. ႀကီးတဲ့သူကို ငယ္သူ က ရိုေသမႈျပသရတာ ကို မင္းဟာ နွစ္သက္ လို့ပဲ.. အဲလိုလည္း မင္း ဟာ စံျပေနေလ့ရွိပါတယ္.. ဒါေပမယ့္..ေယဘုယ်အားျဖင့္ေတာ့.. မင္းဟာ ေအးေဆး တည္ျငိမ္ တဲ့သူ တေယာက္ မဟုတ္ပါဘူး.. မင္းနဲ့ ဆက္ဆံဖို့ဆိုတာ..ခက္ခဲတဲ့ အလုပ္တစ္ ခုပါ..မင္းဟာ စိတ္ဓာတ္ မာတဲ့ ျပိဳင္ဘက္ တေယာက္လိုပဲ... ဒါေပမယ့္လည္း.. တစံုတေယာက္ရဲ့ အျပဳအမႈ ကို မင္းသေဘာက် သြားျပီ ဆိုလည္း.. မင္းတို့နွစ္ေယာက္ရဲ့ ဆက္ဆံေရးဟာ အရမ္းကို ခိုင္မာေနတက္ပါတယ္... မင္းဟာ အျမဲ လိုလို..သူတပါး ဆီက ေလးစားမႈကို ရရွိေနတက္သူ တစ္ဦးပါ.. မင္းဘ၀မွာ ရန္သူေတြ.ျပႆ       နာေတြ အမ်ားႀကီး ရွိမယ္လို့ ထင္ရေပမယ့္.. အဲဒါေတြက ႀကာရွည္ မခံပါဘူး.. ဘာေႀကာင့္လည္း ဆိုေတာ့.. မင္းက ပါရမီရွင္ တေယာက္ လိုပါပဲ.. သူတို့နဲ့ေျဖရွင္းရာမွာ ပိုင္နိုင္လြန္း ပါတယ္.. မင္းဟာ ပိုက္ဆံ ကို အနည္းငယ္  ပို မက္ေမာတဲ့ အတြက္.. သူရဲ့ေစခိုင္းမႈေအာက္မွာ..အဆံုးမရွိ ႀကိဳးစားျခင္းေတြ .ရုန္းကန္ျခင္းေတြနဲ့.. မင္းဟာ နပန္းလံုးေနရတတ္တယ္... မင္းဟာ အမ်ိဳးသားတစ္ဦး ဆိုရင္ေတာ့..အားလံုးဟာ ျပီးၿပည့္စံုေနပါျပီ.. မိသားစု ကို ေစာင့္ေရွာက္တယ္.. သူငယ္ခ်င္းေတြ ကို ကူညီတယ္.. ဘ၀ ကို ေပးကမ္းမႈေတြ..ႀကင္နာေတြ နဲ့ အခ်ိန္ ကုန္လြန္ေစတဲ့သူေပါ့ (ဒါေပမယ့္ ၂၁ ရက္ ေမြးသူ မပါပါ). ျပီးေတာ့ မင္းဟာ စံျပ တေယာက္ျဖစ္ေနပါလိမ့္မယ္.. တကယ္လို့ ..မင္း ဟာ အမ်ိဳးသမီး ဆိုရင္လည္း.. အက်င့္ စရိုက္ေကာင္းေတြ.. ယဥ္ေက်း သိမ္ေမြ႔႔မႈေတြ.. အလုပ္ႀကိဳစားမႈေတြနဲ့ ျပည့္ေနမွာပါ.. မင္းဟာ လြတ္လပ္မႈ ကို ျမတ္နိုးသူ.. တီထြင္သူ.. ရည္မွန္းခ်က္ ႀကီးသူ..အာရံု စူးစိုက္လုပ္တက္သူျပီးေတာ့. ကမၻာ ကို အလွ..ေမွ်ာ္လင့္ခ်က္..ေပ်ာ္ရႊင္မႈေတြ ကို သယ္ေဆာင္လာသူ တစ္ဦးပါပဲ... မင္းရဲ့ အေကာင္းဆံုး အေဖာ္မြန္ ကေတာ့... 6, 9. သင့္ေတာ္တဲ့အေဖာ္မြန္ကေတာ့..1, 3, 5!!!</p>";
            var num4="<p>မင္းလည္း ပဲ ေခါင္း အလြန္မာတဲ့သူ တဦး ပါပဲ.. အလုပ္ကို အရမ္းႀကိဳးစားတယ္..ဒါေပမယ့္ ဘ၀ရဲ့ အေရးႀကီး တဲ့ ကိစၥေတြ မွာေတာ့ ကံ မေကာင္းတက္ပါဘူး.. ေအးေဆးေနတတ္တယ္..ကူညီတက္သူျဖစ္ေပမဲ့  ..စကားေျပာတာ က ပြင့္လင္းလြန္း ပါတယ္..အမ်ိဳးသား ဆိုရင္ေတာ့ အဲဒီ အတြက္နဲ့ပဲ.. တျခားလူေတြ ကို စိတ္ အေႏွာက္ယွက္ပိုျဖစ္ေစျပီ.. မင္းကို ထားျပီး အေ၀း ကို ေျပးသြားတတ္ ႀကပါတယ္.. မင္းဟာ တခါတရံ မွာေတာ့.. တျခား လူေတြနဲ့ သူတို့ရဲ့ ျပႆသနာေတြ ကို ေကာင္းေကာင္းႀကီး နား လည္ေနျပန္ေ၇ာ့.....အခ်ိန္တိုင္း လိုလို မင္းဟာ အမ်ိဳးသမီး မိတ္ေဆြေတြ နဲ့ အခ်ိန္ျဖဳန္းေနတတ္ ၿပီး.. အမ်ိဳးသမီး ငယ္ေတြ နဲ့ ေပ်ာ္ရႊင္ရတာ ကို နွစ္သက္သူ တစ္ဦးပါ.. မင္း သူငယ္ခ်င္းေတြ ဟာ မင္းရဲ့ အခ်ိန္ေတြ..ေငြေတြ ကို သံုးျဖဳန္းျပီ.. အေ၀း ကို ေျပးသြားတတ္  ႀကပါတယ္.. အဲဒီ အခါႀကရင္ေတာ့..မင္းဟာ ခိုးကိုး ရာမဲ့ေနျပီ ဆိုတာ..အေသအခ်ာ ပါပဲ..အဲဒီ အတြက္.. လံုး၀သတိျပဳပါ မင္းရဲ့ စီတ္ထားေကာင္း ကေတာ့.. မိသားစုနဲ့ သူငယ္ခ်င္းေတြကို ကူညီတတ္တာ ပါပဲ.. မင္းဟာ ငယ္ရႊယ္စဥ္ မွာပဲ.. အခ်စ္ကို ေတြ့ရွိတတ္ ပါတယ္.. မင္း ဘ၀မွာ တခါတရံ အဆင္မေျပမႈေတြ နဲ့ ျပည့္နက္ေနတတ္ တယ္.. ဥပမာ.. မင္းဟာ ဘြဲ့ တစ္ခုခု ရထားေပ မယ့္..အလုပ္ လက္မဲ့ျဖစ္ေနတာမ်ိဳးေပါ့.   . ဒါမွမဟုတ္.. ေအာက္ေျခ အလုပ္ကို လုပ္ေနရတာ မ်ိဳးေပါ့.. ဒါေပမယ့္..မင္းရဲ့ မိသားစု ကိုေတာ့..မင္းဟာ ေကာင္းေကာင္းေစာင့္ေရွာက္နိုင္ပါတယ္.. အဓိက သတိ ထားရမယ္႔ လူေတြ ကေတာ့.. မင္းရဲ့ ႀကင္နာတတ္တဲ့ စိတ္ထား ကို အခြင့္ေကာင္းယူမယ့္ သူေတြကိုပါပဲ.. ဒါေႀကာင့္..မင့္နဲ့ ပတ္၀န္းက်င္ ဆက္ဆံေရး ကို အထူး သတိျပဳပါ.. အမ်ိဳးသမီး ဆိုရင္ေတာ့.. မင္းဟာ ပညာရပ္ ပိုင္း နဲ့ အႏုပညာ ပိုင္းမွာ ထြန္းေပါက္နိုင္ပါတယ္.. မင္းဟာ..စိတ္ရွည္တယ္.. ေခါင္းမာတယ္.. ေရွးရိုနည္းနည္း ဆန္ျပီး .. အစီအစဥ္ တက်လုပ္ကိုင္ တတ္သူ တေယာက္ျဖစ္တယ္... မင္းရဲ့ အေကာင္းဆံုး အေဖာ္မြန္ေတြ ကေတာ့.. 1, 8.သင့္ေတာ္တဲ့ သူေတြ ကေတာ့...5, 6, 7!!!</p>";
            var num5="<p>မင္းဟာ မင္း၇ဲ႔ ပတ္၀န္းက်င္မွာ ေက်ာ္ႀကားတဲ့သူ တစ္ဦးပါ.. မင့္ရဲ့ နႈတ္ထြက္ စကားေလးနဲ့ တင္..မင္း အလို ရွိရာ ကို ရနိုင္ပါတယ္..မင္းဟာ စီးပြားေရး အျမင္ စူးရွသူ တစ္ဦးလည္း ျဖစ္တယ္.. ဒါေပမယ့္.. မင္းဟာ စနစ္ ရွိလို႔ ေတာ့ မဟုတ္ပါဘူး..ေခါင္းထဲေပၚလာ ကို လုပ္တတ္ သူပါ. တကယ္ လို့ စီးပြားေရး လုပ္ငန္းတခု ကို တည္ေထာင္မယ္ ဆိုရင္လည္း..ေအာင္ျမင္မယ္႔႔ သူပါ.. ျပီးေတာ့ ဟာသဥာဏ္ ရႊင္တဲ့သူ လည္းျဖစ္ေနျပန္ေရာ့.. မိသားစုနဲ့ သူငယ္ခ်င္းေတြ အတြက္ေတာ့.. မင္းဟာ တစ္ကယ့္ ကယ္တင္ရွင္ႀကီး တစ္ဦးပါပဲ.. တကယ္လည္း.. မင္းဟာ လက္ေတြ့ က်က် ကူညီတတ္သူ တစ္ဦးပါ... မင္းဟာ နည္းနည္းေတာ့ ျမွာေပြ တတ္ ေပမယ့္.. ဘ၀ ကို တည္ေဆာက္မယ္ ဆိုတဲ့ အခါမွာေတာ့.. ကိုယ္က်ိဳး တြက္ ႀကည့္ျပီး မွ ေရႊးခ်ယ္ တတ္သူပါ... မင္းဟာ လက္ထက္ျပီး တာေတာင္မွ ေက်ာ္ႀကားေနဦးမယ္႔ သူပါ..အဲဒီ အတြက္.. သတိထားရမယ္႔ အခ်က္ ကေတာ့ မင့္ရဲ့ ေျခရႈပ္ ခ်င္တဲ့ စိတ္ထားေလး ပါပဲ.. အသိ တရား နဲ့ ထိန္းခ်ဳပ္ ရင္ေတာ့..အရာအားလံုး အဆင္ေျပေနပါ လိမ့္မယ္... မင္းဟာ လူတိုင္း နဲ့ ပုလဲနံ သင့္ပါတယ္..ဘာေႀကာင့္လည္း ဆိုေတာ့.. နံပါတ္ ၅ ဟာ အလယ္ ဂဏာန္း ျဖစ္ေန လို့ပဲ.. ေျပာင္းလဲမႈ နဲ့ လြတ္လပ္မႈ ကို ျမတ္နိုးသူ.. ဆြဲေဆာင္မႈ အျပည့္ ရွိတဲ့ မ်က္နွာ ပိုင္ရွင္ေပါ့... အေတြ့ အႀကံဳ ကေန မင္းဘ၀ ကို တည္ေဆာက္ရတဲ့ သူျဖစ္ျပီး..အဲဒီ အေတြ့အႀကံဳေတြ ကပဲ.. မင္းရဲ့ အေကာင္းဆံုး ဆရာ သမားေတြျဖစ္ေနေလရဲ့... မင္းရဲ့ အေကာင္းဆံုး အေဖာ္မြန္ ကေတာ့.... 1, 2, 9..... သင့္ေတာ္တဲ့ သူကေတာ့. 6, 8!!!</p>";
            var num6="<p>အိုး... မင္း ေပ်ာ္ရႊင္ဖို့ အတြက္ပဲ ေမြးဖြား လာတာ ပါလား.. မင္းဟာ တျခားလူရဲ့ ခံစားခ်က္ကို ဂရုမစိုက္ တတ္ သူ တစ္ဦးေပါ့..ဆိုလို တာက မင္း ဘ၀မွာ မင္းဟာ အျမဲတမ္း ေပ်ာ္ရႊင္ေနခ်င္တဲ့ သူပါ.. မင္းဟာ ပညာေရး ..အလုပ္..စီမံခန့္ခြဲမႈ မွာ ပဲျဖစ္ျဖစ္.. ေအာင္ျမင္သူ တစ္ဦးပါ.. မင္းဟာ ႀကင္နာတတ္ ပါတယ္..(ဒါေပမယ့္ မင့္စိတ္ထဲ မွာ ေကာင္းတယ္လို့ ထင္တဲ့ လူေတြ အေပၚမွာသာ)..... ရုပ္ရည္ အရမ္းေခ်ာေမာေနတက္ျပီး .. ဘ၀ ဟာလည္း. ကံေကာင္းျခင္းေတြ စုေနတတ္ပါတယ္.. ကံႀကမၼာေကာင္းေတြ ဟာ မင္းနဲ့ အတူ လာတယ္လို့ ေျပာလို့ ရနိုင္ပါတယ္.. မင္းရဲ့ စိတ္ထား နဲ့ ခႏၶာဟာ အခ်စ္ ကိစၥေတြ မွာ လိႈက္လႈိက္ လွဲလွဲ ရွိလွပါတယ္.. တျခားနံပါတ္ေတြ ရဲ့ ခ်စ္ျခင္းေမတၱာ ကို ခံရတတ္ပါတယ္...ဒါေပမယ့္.. မင္းဟာ အမ်ိဳးသား ဆိုရင္ေတာ့.. လက္ထပ္တဲ့ အခ်ိန္အထိ မိန္းကေလးငယ္ မ်ားနဲ့ ရင္းရင္း နွီးနွီးေနရတာကို နွစ္သက္တဲ့သူ တဦးပါ.. အမ်ိဳးသမီးသာ ဆိုရင္ေတာ့.. ေစ့စပ္ေႀကာင္းလမ္းမႈ..ဒါမွ မဟုတ္ လက္ထပ္ တာ ကို ေစာေစာစီးစီး ရင္ဆိုင္ ရတတ္ပါတယ္.. ႀကင္နာတတ္သူေတြ ပဲ မင့္ ဘ၀ထဲကို ၀င္လာပါ လိမ့္မယ္.. ေယဘုယ် အားျဖင့္ေတာ့.. မင္းဟာ အိမ္ရဲ့ ဆည္းလည္းေလး ပါပဲ... စာနာတတ္သူ...နွစ္သိမ့္မႈေပးနိုင္သူ .မွ်တသူ.. အိမ္ေထာင္မႈနိုင္နင္းသူ. .ဆံုးျဖတ္ခ်က္ေကာင္းမြန္သူ တစ္ဦး ပါပဲ...ကုန္ကုန္ေျပာရရင္.. မင့္ရဲ့ အႀကင္နာေတြ နဲ့..ဒီ ကမၻာေလာကႀကီး ရဲ့ ဒဏ္ရာ ဒဏ္ခ်က္ေတြကို ကုစားေပးနိုင္သူ တေယာက္ပါပဲ... မင္းရဲ့ အေကာင္းဆံုး အေဖာ္မြန္ေတြ ကေတာ့.. 1, 6, and  9. သင့္ေလ်ာ္တဲ့ သူေတြကေတာ့.. 4, 5!!!</p>";
            var num7="<p>မင္းဟာ ဆြဲေဆာင္မႈ ရွိသူ.. ယထာဘူတ ၀ါဒီ တေယာက္ပါ.. မိမိကိုယ္ ကို ယံုႀကည္တတ္ တယ္. .ေပ်ာ္ေပ်ာ္ ရႊင္ရႊင္ေနတတ္ ၿပီး ..ပညာေရး မွာ ထူးခၽြန္သူ တစ္ဦးပါ.. ဂီတ.အနုပညာ..သီခ်င္း ဆို..သရုပ္ေဆာင္ နယ္ပယ္ေတြမွာ လည္း.. ထူးခၽြန္နိုင္သူပါ.. မင္းရဲ့ျပႆ         နာ ကေတာ့..မင့္ရဲ့ေဒါသ စိတ္ ပါပဲ.. အမ်ိဳးသမီး ဆိုရင္ေတာ့. အထက္က အခ်က္ေတြနဲ့ မင္းဟာ ေအာင္ျမင္နိုင္ပါတယ္.. မင္းဟာ..မင့္ မိဘ အတြက္ ဘာမဆို စြန့္လႊ႔တ္နိုင္သူလည္းျဖစ္တယ္..(ဆိုလို တာက မိသားစု ကို အရမ္း တန္ဖိုး ထား တတ္ တာပါ) အရြယ္ ရလာတာနဲ့ အမွ် မင္းရဲ့ အဆင့္အတန္း ကလည္း တျဖည္းျဖည္း ျမင့္တက္ေန မွာပါ.. အမ်ိဳးသား တစ္ဦး သား ဆိုရင္ေတာ့ အမ်ိဳးသမီးထု ႀကားမွာ ေရပန္းစားမယ့္ သူပါ..ဘက္စံု ထူးခၽြန္သူ တစ္ဦး လည္းျဖစ္ေန ပါတယ္.. နံပါတ္ (၇) သမား အမ်ားစု ဟာ သူတို့ရဲ့ အိမ္ေထာင္သည္ ဘ၀မွာ အဆင္မေျပႀကတာ မ်ားပါတယ္.. အနည္း စုေလာက္ပဲ ေပ်ာ္ရႊင္ ခ်မ္းေျမ႔တဲ့ ဘ၀ကို တည္ေဆာက္နိုင္ႀကတာပါ.... မင္းရဲ့ ဘ၀မွာ အရာအားလံုး ရွိေနေပ မယ့္.. အလိုမက်မႈေတြ..စိုးရိမ္ေႀကာင့္က်မႈေတြ ကလည္း ရွိေနတတ္ ၿပန္ေရာ .. ဒါကလည္း..ဘုရားသခင္ က မင္းကို အရာအားလံုး မွ်တေအာင္ ေပးထားတဲ့ သေဘာလို့ ထင္ပါ တယ္ .. မင္းလို ထူးခြ်န္တဲ့ သူ ၁၀၀ေလာက္ ကို နႈိုင္းယွဥ္ႀကည့္မယ္ ဆိုရင္ မင္း တစ္ေယာက္ေလာက္ ပဲ အိမ္ေထာင္ေရး မသာယာတာ မ်ိဳးေတြ့ရတတ္ ပါတယ္.. ဒါေႀကာင့္.. ႀကင္ေဖာ္ ကို ေစာင့္စားေနတာထက္.. ကိုယ္နဲ့ လိုက္ေလ်ာ္ညီေထြမယ့္ သူကို ေစာေစာ စီးစီး ရွာထားသင့္ပါတယ္... အဲလိုမွ မလုပ္ခ်င္ဘူး ဆိုရင္ေတာ့..မင္းဟာ ဘ၀ ကို အထီး က်န္စြာ ျဖတ္သန္း သြားရမွာ အေသအခ်ာ ပါပဲ. .ဒါေႀကာင့္..ဒီကိစၥ နဲ့ ပတ္သက္ျပီး ေသခ်ာ ဂရုစိုက္ အေလးထားသင့္ ပါတယ္.. မင္းဟာ အံဖြယ္ေကာင္းေသာ.ေဖာ္ေရႊေသာ.ယဥ္ေက်း သိမ့္ေမြ႔ေသာ ေပ်ာ္ေပ်ာ္ေနတတ္ တဲ့ လူ တေယာက္ ပါ ..မင္းဟာ ဒီကမၻာေလာကႀကီး ကို ျဖည့္ဆည္းေပးဖို့ ေမြးဖြားလာသူ တစ္ဦးပါ.. မင္းရဲ့ အေကာင္းဆံုး အေဖာ္မြန္ေတြ ကေတာ့.. 2. သင့္ေတာ္တဲ့ အေဖာ္မြန္ကေတာ့.. 1,4 !!!</p>";
            var num8="<p>မင္းရဲ့ ဘ၀ ဟာ ႀကမ္းတမ္းလြန္း ပါတယ္. ဘာေႀကာင့္ ဆိုတာ. ဘယ္သူမွ မင္းကို နားလည္နိုင္မွာ မဟုတ္ ပါဘူး.. သူတပါး ကို အျပစ္ေျပာရာ မွာ မင္းဟာ တဖက္ကမ္းခတ္ ကၽြမ္းက်င္ လွပါတယ္.. မင္းရဲ့ ငယ္စဥ္ ဘ၀ဟာ ဆင္းရဲ နံုခ်ာနိုင္ပါတယ္.. အေျခအေန က မေပးဘူး ဆိုရင္ေတာ့.. မင့္ရဲ့ မိဘေတြကိုေတာင္ ေစာစီးစြာ လက္လႊတ္ ရနိုင္ပါတယ္.. ဒီလိုမ်ိဳး အျဖစ္အပ်က္ေတြက မင့္ဘ၀ထဲမွာ မႀကာခဏျဖစ္ေနမယ္႔အရာေတြပါ.. ဒီျပႆ          နာေတြ ကပဲ မင္းရဲ့ ပညာေရး ကို တားဆီးေနပါလိမ့္မယ္.. ဒါေပမယ့္ မင္းဟာ ဘ၀ကို တျခားနည္း နဲ့ ေလ့လာသင္ယူနိုင္ပါလိမ့္မယ္. မင္းဟာ တရားမွ်တမႈ အတြက္ တိုက္ပြဲ၀င္ရဲတဲ့ သူ တစ္ဦးပါ..ဒါေပမယ့္ အဲဒီ တိုက္ပြဲ မွာပဲ က်ဆံုးနိုင္သူ လည္း ျဖစ္ေနျပန္ေ၇ာ့. ပံုမွန္အားျဖင့္..မိတ္ေဆြေတြ နဲ့ ဆက္ဆံရာ မွာ မင္းဟာ တည္ႀကည္ေလးနက္စြာ ေနတတ္ ၿပီး.. ဘ၀ ကိုလည္း..အထီးက်န္စြာ ျဖတ္သန္းေနရမယ့္သူပါ.. ျပီးေတာ့ တပါးသူ ကို ကူညီဖို့ အသင့္ရွိေနသူ တစ္ဦးပါ.. မင္း အိမ္ေထာင္က်တဲ့ အခါမွာေတာ့ (အဲဒါ ကလည္း.. အမ်ားအားျဖင့္ အလယ္ အလတ္ အရြယ္ မွာပဲ ျဖစ္ ပြားတတ္ ပါတယ္) မင့္ရဲ့ ကံႀကမၼာဆိုး အနည္းငယ္ ဟာ လြင့္ေပ်ာက္ သြားသလို ခံစားရပါ လိမ့္မယ္..ျပီးေတာ့ မင္းဟာ လံုျခံဳခ်မ္းေျမ့မႈ ကို ရရွိပါလိမ့္မယ္.. မင္းဟာ မေမွ်ာ္လင့္တဲ့ အႏၱရာယ္ေတြ ကိုလည္း..ယွဥ္ဆိုင္ေတြ႔ရနိုင္ပါတယ္.. ဥပမာ..( အမႈအခင္းမ်ား .အဆိပ္ ရွိ သတၱ၀ါမ်ား..မေတာ္တဆ ထိခို္က္မႈမ်ား နဲံ ႀကံုေတြနိုင္ပါတယ္) သိုေပသိ.. မင္းဟာ စည္းကမ္းလိုက္နာတဲ့ သူ..လံု့လ ၀ီရိယ ရွိသူ.ရဲရင့္သူ.. ခြန္းအား ဗလ နဲ့ျပည့္စံုသူ. တစ္ေယာက္ပါ.. အဲဒါေတြ ကပဲ မင္းကို ေအာင္ျမင္မႈ ဆီကို ေခၚေဆာင္သြားမွာပါ.. မင္းဟာ မိသားစု ရဲ့ အဓီက အစိတ္ အပိုင္း တစ္ခုပါ.. အားကိုးရဆံုး သူတစ္ဦးလည္းျဖစ္ျပီး.. ဖိုက္တာ တစ္ဦး လည္းျဖစ္ေနျပန္ေရာ့... မင္းရဲ့ အေကာင္းဆံုး အေဖာ္မြန္ ကေတာ့.. 1, 4, and 8. သင့္ေတာ္တဲ့ အေဖာ္မြန္ ကေတာ့ 5!!!</p>";
            var num9="<p>မင္း ကေတာ့ ဒီ ကမၻာေလာကႀကီး မွာ သဟဇာတ မျဖစ္ဆံုး လူသား တစ္ဦးေပါ့.. မင္းဟာ ရုပ္ပိုင္း..စိတ္ပိုင္း အရမ္း ကို ႀကံ႔ခိုင္လြန္းသူ တစ္ဦးပါ.. ရည္မွန္းခ်က္ႀကီးမားသူ တစ္ဦးလည္းျဖစ္ျပန္ေရာ့.. မင္းဟာ အလုပ္ ကို အရမ္းႀကိဳးစား လုပ္ကိုင္ရမွာျဖစ္ျပီး.. ေအာင္ျမင္မႈကို လည္း ခက္ခဲစြာ ရယူရမယ့္ သူ တစ္ဦးပါ.. သာမန္ အားျဖင့္ေတာ့ ငယ္ရြယ္စဥ္ မွာ မင္းဟာ မိသားစုျပသနာေတြ နဲ့ လံုးပန္းေနရတတ္ ပါ တယ္..ျပီးေတာ့ ဘ၀ ဟာလည္း. ရုန္းရင္း ဆန္ခတ္မႈေတြ နဲ့ ျပည့္နွက္ေန ပါတယ္.. ဒါေပမယ့္ မင္း အလိုရွိတာကို ရရွိတဲ့ အခ်ိန္က စျပီးေတာ့ မင္းရဲ့ ဘ၀ လံုး၀ေျပာင္းလဲသြား ပါလိမ့္မယ္.. မင္းဟာ ပတ္၀န္းက်င္မွာ အေလးစား ခံရဆံုး ပုဂၢိဳလ္တစ္ဦးျဖစ္ေနပါလိမ့္မယ္.. စိန္ေခၚမႈေတြကို နွစ္သက္ျပီး.. ျပိဳင္ဘက္ေတြ ကို အလဲ ထိုးနိုင္တဲ့သူ တစ္ဦးေပါ့.. ငယ္ရြယ္စဥ္ မွာေတာ့ မင္းဟာ အရမ္း ကို ေပေတ မဲ့ ကေလးတေယာက္ပါ.. မိဘ က မႀကာခဏ ရိုက္နက္ ဆံုးမရသူ.. ရန္ ခဏ ခဏ ျဖစ္တတ္သူ တစ္ဦးေပါ့.. မင့္ဘ၀ ဟာ ဒဏ္ရာ အနာတ၇ေတြ နဲ့ ျပည့္နက္ေန သလိုပါပဲ.. ဒါေပမယ့္..အရြယ္ေရာက္လာတဲ့ အခါ မွာေတာ့.. မင္းဟာ ေအးေဆး တည္ျငိမ္လာျပီး.. ေယာက်ာ္း ပီသစြာ ေနထိုင္ျပန္ေရာ့.. ခ်စ္ျခင္းေမတၱာ ကေတာ့ မင္း အတြက္ လြယ္ကူတဲ့ ကိစၥေတာ့ မဟုတ္ပါဘူး.. မင္းဟာ ေဆာက္လုပ္ေရး အလုပ္ ..ဘဏ္ အလုပ္ေတြနဲ့ သင့္ေလွ်ာ္ပါတယ္.. ဘာေႀကာင့္လဲ ဆိုေတာ့ လူေတြ က မင့္ကို ယံုႀကည့္ႀက လို့ပါပဲ.. မင့္ရဲ့ မိသားစု ဘ၀ ကေတာ့ အရမ္းကို ေကာင္းမြန္လွ ပါတယ္. ဒါေပမယ့္ မင့္ ကေလးေတြ အတြက္ေတာ့ စိုးရိမ္ရပါ လိမ့္မယ္.. မင္းဟာ လူလူခ်င္း စာနာတတ္သူ ..စိတ္ရွည္သူ.. ပညာဥာဏ္ႀကီးမားသူ ..နားလည္းခြင့္လြတ္ေပးနိုင္သူ တစ္ဦး ပါ... မင္းဟာ ရည္မွန္းခ်က္ေတြ ကို ရယူဖို့.. အဂတိ တရား မထားပဲ လူေတြ အေပၚ အလုပ္အေကၽြးျပဳ ဖို့ ေမြးဖြား လာသူ တစ္ဦးပါ... မင္းဟာ အံ့ဖြယ္ စိတ္ကူး စိတ္သန္းေတြ မွာ လူတိုင္း အတြက္ စံျပ တေယာက္ပါ.. မင့္ရဲ့ အေကာင္းဆံုး အေဖာ္မြန္ ကေတာ့.. 3, 5, 6, and   9. သင့္ေတာ္တဲ့ အေဖာ္မြန္ ကေတာ့ 2     !!!</p>";

            switch(lucky)
            { 
                case 1: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num1;
                    break;
                }
                case 2: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num2;
                    break;
                }
                case 3: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num3;
                }
                case 4: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num4;
                }
                case 5: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num5;
                }
                case 6: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num6;
                }
                case 7: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num7;
                }
                case 8: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num8;
                }
                case 9: {
                    elTitle.innerHTML = "<h2>"+lucky+" ဂဏန္း သမား </h2>";
                    elDetail.innerHTML = num9;
                }
            }

        }else{
            clear();
            elErrorMsg.innerHTML = "Please enter all fields!";
            
            }
        
    }
        
    function clear() {
        elSwForm.reset();
        elTitle.innerHTML= ' ';
        elDetail.innerHTML=' ';
        elErrorMsg.innerHTML=' ';
        }   
           
    elBtnCalculate.addEventListener("click", show, false);
    btnClear.addEventListener("click", clear, false);
}());